# 10分钟 Pandas 历险

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
len(dir(pd))

175

In [4]:
pd.__version__

'0.20.2'

In [9]:
for k in dir(pd) :
    if '__' in k:
        print(k)

__builtins__
__cached__
__doc__
__docformat__
__file__
__loader__
__name__
__package__
__path__
__spec__
__version__

In [10]:
pd.__path__

['/Users/zoomq/.pyenv/versions/3.6.1/envs/DU361/lib/python3.6/site-packages/pandas']

## 创建对象

In [15]:
 s = pd.Series([1,3,5,np.nan,6,'是也乎'])

In [16]:
type(s)

pandas.core.series.Series

In [17]:
s

0      1
1      3
2      5
3    NaN
4      6
5    是也乎
dtype: object

In [24]:
dates = pd.date_range('20130101', periods=6)
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [25]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [27]:
df = pd.DataFrame(np.random.randn(6,4)
                  , index=dates
                  , columns=list('ABCD')
                 )
type(df)

pandas.core.frame.DataFrame

In [30]:
len(dir(df))

449

In [31]:
df

                   A         B         C         D
2013-01-01  1.188941  1.129330  1.366866 -0.307524
2013-01-02 -0.513417 -0.358673 -0.259177 -0.612110
2013-01-03 -0.510545 -2.012525  0.268398 -0.613824
2013-01-04 -0.031261 -1.353902  1.873059 -0.273769
2013-01-05  0.247923 -0.846868 -0.981051  0.480899
2013-01-06  0.114437  1.767723  0.663675 -2.535318

In [32]:
help(np.random.randn)

Help on built-in function randn:

randn(...) method of mtrand.RandomState instance
    randn(d0, d1, ..., dn)

    Return a sample (or samples) from the "standard normal" distribution.

    If positive, int_like or int-convertible arguments are provided,
    `randn` generates an array of shape ``(d0, d1, ..., dn)``, filled
    with random floats sampled from a univariate "normal" (Gaussian)
    distribution of mean 0 and variance 1 (if any of the :math:`d_i` are
    floats, they are first converted to integers by truncation). A single
    float randomly sampled from the distribution is returned if no
    argument is provided.

    This is a convenience function.  If you want an interface that takes a
    tuple as the first argument, use `numpy.random.standard_normal` instead.

    Parameters
    ----------
    d0, d1, ..., dn : int, optional
        The dimensions of the returned array, should be all positive.
        If no argument is given a single Python float is returned.

    Returns
    -------
    Z : ndarray or float
        A ``(d0, d1, ..., dn)``-shaped array of floating-point samples from
        the standard normal distribution, or a single such float if
        no parameters were supplied.

    See Also
    --------
    random.standard_normal : Similar, but takes a tuple as its argument.

    Notes
    -----
    For random samples from :math:`N(\mu, \sigma^2)`, use:

    ``sigma * np.random.randn(...) + mu``

    Examples
    --------
    >>> np.random.randn()
    2.1923875335537315 #random

    Two-by-four array of samples from N(3, 6.25):

    >>> 2.5 * np.random.randn(2, 4) + 3
    array([[-4.49401501,  4.00950034, -1.81814867,  7.29718677],  #random
           [ 0.39924804,  4.68456316,  4.99394529,  4.84057254]]) #random

In [33]:
np.random.randn()

0.33746536419417006

In [34]:
np.random.randn(2)

array([ 2.15852083, -0.66123487])

In [37]:
np.random.randn(5,3)

array([[ 0.14762553, -1.52867424, -0.12074558],
       [-2.0694367 , -1.68786366, -0.9502297 ],
       [ 0.68132388, -0.75754698, -0.50054001],
       [ 0.78757602,  1.73896966,  0.21467194],
       [ 0.02915606,  0.35940296,  0.73279622]])

In [41]:
#dates = pd.date_range('20130101', periods=6)
_lines = 7
df = pd.DataFrame(np.random.randn(_lines,4)
                  , index=pd.date_range('20130101'
                                        , periods=_lines)
                  , columns=list('ABCD')
                 )
df

                   A         B         C         D
2013-01-01  0.773841 -2.157808  0.984614 -2.097593
2013-01-02 -1.550663  1.715276 -0.208843 -0.813946
2013-01-03  0.312465 -0.286060 -1.213577 -1.056977
2013-01-04  1.372956  0.060266  1.486997 -0.921437
2013-01-05  1.284129 -0.102916  0.065467  0.099667
2013-01-06 -0.045638 -1.231555  0.422141 -1.604347
2013-01-07  0.016691  0.501258  0.056150 -1.571234

In [42]:
df2 = pd.DataFrame({ 'A' : 1.,
   ....:             'B' : pd.Timestamp('20130102'),
   ....:             'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:             'D' : np.array([3] * 4,dtype='int32'),
   ....:             'E' : pd.Categorical(["test","train","test","train"]),
   ....:             'F' : 'foo' })

In [43]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [44]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [45]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [47]:
len(dir(df2))

451

## 数据观察

In [48]:
df.head()

                   A         B         C         D
2013-01-01  0.773841 -2.157808  0.984614 -2.097593
2013-01-02 -1.550663  1.715276 -0.208843 -0.813946
2013-01-03  0.312465 -0.286060 -1.213577 -1.056977
2013-01-04  1.372956  0.060266  1.486997 -0.921437
2013-01-05  1.284129 -0.102916  0.065467  0.099667

In [49]:
df.tail()

                   A         B         C         D
2013-01-03  0.312465 -0.286060 -1.213577 -1.056977
2013-01-04  1.372956  0.060266  1.486997 -0.921437
2013-01-05  1.284129 -0.102916  0.065467  0.099667
2013-01-06 -0.045638 -1.231555  0.422141 -1.604347
2013-01-07  0.016691  0.501258  0.056150 -1.571234

In [50]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D')

In [51]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [52]:
df.values

array([[ 0.77384137, -2.15780788,  0.98461431, -2.09759253],
       [-1.55066324,  1.71527573, -0.20884264, -0.81394591],
       [ 0.31246472, -0.28606005, -1.21357664, -1.05697663],
       [ 1.37295584,  0.06026604,  1.48699717, -0.92143693],
       [ 1.28412926, -0.10291624,  0.06546665,  0.09966702],
       [-0.0456384 , -1.23155468,  0.42214095, -1.60434672],
       [ 0.0166913 ,  0.50125822,  0.05615016, -1.57123416]])

In [53]:
df.describe()

              A         B         C         D
count  7.000000  7.000000  7.000000  7.000000
mean   0.309112 -0.214506  0.227564 -1.137981
std    0.997374  1.234251  0.867962  0.709023
min   -1.550663 -2.157808 -1.213577 -2.097593
25%   -0.014474 -0.758807 -0.076346 -1.587790
50%    0.312465 -0.102916  0.065467 -1.056977
75%    1.028985  0.280762  0.703378 -0.867691
max    1.372956  1.715276  1.486997  0.099667

In [54]:
df.D.describe()

count    7.000000
mean    -1.137981
std      0.709023
min     -2.097593
25%     -1.587790
50%     -1.056977
75%     -0.867691
max      0.099667
Name: D, dtype: float64

In [55]:
df.T

,2013-01-01 00:00:00,2013-01-02 00:00:00,2013-01-03 00:00:00,2013-01-04 00:00:00,2013-01-05 00:00:00,2013-01-06 00:00:00,2013-01-07 00:00:00
A,0.773841,-1.550663,0.312465,1.372956,1.284129,-0.045638,0.016691
B,-2.157808,1.715276,-0.286060,0.060266,-0.102916,-1.231555,0.501258
C,0.984614,-0.208843,-1.213577,1.486997,0.065467,0.422141,0.056150
D,-2.097593,-0.813946,-1.056977,-0.921437,0.099667,-1.604347,-1.571234

In [63]:
sdf = df.sort_index(axis=0, ascending=False)
sdf

                   A         B         C         D
2013-01-07  0.016691  0.501258  0.056150 -1.571234
2013-01-06 -0.045638 -1.231555  0.422141 -1.604347
2013-01-05  1.284129 -0.102916  0.065467  0.099667
2013-01-04  1.372956  0.060266  1.486997 -0.921437
2013-01-03  0.312465 -0.286060 -1.213577 -1.056977
2013-01-02 -1.550663  1.715276 -0.208843 -0.813946
2013-01-01  0.773841 -2.157808  0.984614 -2.097593

In [58]:
df

                   A         B         C         D
2013-01-01  0.773841 -2.157808  0.984614 -2.097593
2013-01-02 -1.550663  1.715276 -0.208843 -0.813946
2013-01-03  0.312465 -0.286060 -1.213577 -1.056977
2013-01-04  1.372956  0.060266  1.486997 -0.921437
2013-01-05  1.284129 -0.102916  0.065467  0.099667
2013-01-06 -0.045638 -1.231555  0.422141 -1.604347
2013-01-07  0.016691  0.501258  0.056150 -1.571234

In [67]:
df.sort_values(by='A', ascending=False)

                   A         B         C         D
2013-01-04  1.372956  0.060266  1.486997 -0.921437
2013-01-05  1.284129 -0.102916  0.065467  0.099667
2013-01-01  0.773841 -2.157808  0.984614 -2.097593
2013-01-03  0.312465 -0.286060 -1.213577 -1.056977
2013-01-07  0.016691  0.501258  0.056150 -1.571234
2013-01-06 -0.045638 -1.231555  0.422141 -1.604347
2013-01-02 -1.550663  1.715276 -0.208843 -0.813946

## 数据选择
~ 参考
- [Indexing and Selecting Data](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing)
- [MultiIndex / Advanced Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced)

### 选取

In [68]:
df.A

2013-01-01    0.773841
2013-01-02   -1.550663
2013-01-03    0.312465
2013-01-04    1.372956
2013-01-05    1.284129
2013-01-06   -0.045638
2013-01-07    0.016691
Freq: D, Name: A, dtype: float64

In [69]:
df['A']

2013-01-01    0.773841
2013-01-02   -1.550663
2013-01-03    0.312465
2013-01-04    1.372956
2013-01-05    1.284129
2013-01-06   -0.045638
2013-01-07    0.016691
Freq: D, Name: A, dtype: float64

In [70]:
df[0:3]

                   A         B         C         D
2013-01-01  0.773841 -2.157808  0.984614 -2.097593
2013-01-02 -1.550663  1.715276 -0.208843 -0.813946
2013-01-03  0.312465 -0.286060 -1.213577 -1.056977

In [72]:
df[-2:]

                   A         B         C         D
2013-01-06 -0.045638 -1.231555  0.422141 -1.604347
2013-01-07  0.016691  0.501258  0.056150 -1.571234

In [73]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D')

In [78]:
df['130103':'6/1/2013']

                   A         B         C         D
2013-01-01  0.773841 -2.157808  0.984614 -2.097593
2013-01-02 -1.550663  1.715276 -0.208843 -0.813946
2013-01-03  0.312465 -0.286060 -1.213577 -1.056977
2013-01-04  1.372956  0.060266  1.486997 -0.921437
2013-01-05  1.284129 -0.102916  0.065467  0.099667
2013-01-06 -0.045638 -1.231555  0.422141 -1.604347
2013-01-07  0.016691  0.501258  0.056150 -1.571234

### 以标签为选取

In [79]:
df.loc[dates[0]]

A    0.773841
B   -2.157808
C    0.984614
D   -2.097593
Name: 2013-01-01 00:00:00, dtype: float64

In [80]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [81]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D')

In [83]:
df.loc[df.index[-1]]

A    0.016691
B    0.501258
C    0.056150
D   -1.571234
Name: 2013-01-07 00:00:00, dtype: float64

In [86]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.773841 -2.157808
2013-01-02 -1.550663  1.715276
2013-01-03  0.312465 -0.286060
2013-01-04  1.372956  0.060266
2013-01-05  1.284129 -0.102916
2013-01-06 -0.045638 -1.231555
2013-01-07  0.016691  0.501258

In [89]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.550663  1.715276
2013-01-03  0.312465 -0.286060
2013-01-04  1.372956  0.060266

In [90]:
df.loc['20130102',['A','B']]

A   -1.550663
B    1.715276
Name: 2013-01-02 00:00:00, dtype: float64

In [91]:
type(df.loc['20130102',['A','B']])

pandas.core.series.Series

In [95]:
df.loc[dates[0],'A']

0.77384137275882281

In [97]:
type(df.loc[dates[0],'A'])

numpy.float64

In [98]:
 df.at[dates[0],'A']

0.77384137275882281

### 以位置来选取

In [99]:
df.iloc[3]

A    1.372956
B    0.060266
C    1.486997
D   -0.921437
Name: 2013-01-04 00:00:00, dtype: float64

In [105]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.372956  0.060266
2013-01-05  1.284129 -0.102916

In [103]:
df

                   A         B         C         D
2013-01-01  0.773841 -2.157808  0.984614 -2.097593
2013-01-02 -1.550663  1.715276 -0.208843 -0.813946
2013-01-03  0.312465 -0.286060 -1.213577 -1.056977
2013-01-04  1.372956  0.060266  1.486997 -0.921437
2013-01-05  1.284129 -0.102916  0.065467  0.099667
2013-01-06 -0.045638 -1.231555  0.422141 -1.604347
2013-01-07  0.016691  0.501258  0.056150 -1.571234

In [106]:
df.iloc[3:5,-2:]

                   C         D
2013-01-04  1.486997 -0.921437
2013-01-05  0.065467  0.099667

In [107]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.550663 -0.208843
2013-01-03  0.312465 -1.213577
2013-01-05  1.284129  0.065467

In [108]:
#dates = pd.date_range('20130101', periods=6)
_lines = 10
df = pd.DataFrame(np.random.randn(_lines,6)
                  , index=pd.date_range('20130101'
                                        , periods=_lines)
                  , columns=list('ABCDEF')
                 )
df

                   A         B         C         D         E         F
2013-01-01  0.849393 -0.338225 -1.234400 -2.097684 -0.180007 -0.538386
2013-01-02 -0.731341  0.793129 -1.033614 -0.751996 -0.156103 -1.756150
2013-01-03 -0.985722 -0.446734  0.069194  0.582819 -0.924979 -1.314141
2013-01-04 -0.466835  0.280120  1.393321 -0.725856 -1.293547 -0.423523
2013-01-05  0.322897 -2.453072 -1.121637  0.506722  0.375510  1.451425
2013-01-06  0.463152 -0.483672 -0.064939 -0.600408  0.892167  1.158472
2013-01-07 -0.800244 -0.721945  0.995858  0.151096  1.540500  2.124193
2013-01-08  1.621622 -0.750952 -0.212247 -0.420051 -0.080137  0.295026
2013-01-09  0.052636 -0.211462 -0.622754  0.253277 -0.156381 -3.228651
2013-01-10 -0.316654  0.501695  0.890174  0.014403  0.994278  1.219175

In [113]:
range(10,0,2)

range(10, 0, 2)

In [119]:
df.iloc[range(0,6,2),[0,2]]

                   A         C
2013-01-01  0.849393 -1.234400
2013-01-03 -0.985722  0.069194
2013-01-05  0.322897 -1.121637

In [120]:
df.iloc[1:3,:]

                   A         B         C         D         E         F
2013-01-02 -0.731341  0.793129 -1.033614 -0.751996 -0.156103 -1.756150
2013-01-03 -0.985722 -0.446734  0.069194  0.582819 -0.924979 -1.314141

In [121]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.338225 -1.234400
2013-01-02  0.793129 -1.033614
2013-01-03 -0.446734  0.069194
2013-01-04  0.280120  1.393321
2013-01-05 -2.453072 -1.121637
2013-01-06 -0.483672 -0.064939
2013-01-07 -0.721945  0.995858
2013-01-08 -0.750952 -0.212247
2013-01-09 -0.211462 -0.622754
2013-01-10  0.501695  0.890174

In [122]:
df.iloc[1,1]

0.79312904166218234

In [123]:
df.iat[1,1]

0.79312904166218234

In [124]:
df.iat[:,1:3]

ValueError: iAt based indexing can only have integer indexers

### 逻辑索引

In [125]:
df.head()

                   A         B         C         D         E         F
2013-01-01  0.849393 -0.338225 -1.234400 -2.097684 -0.180007 -0.538386
2013-01-02 -0.731341  0.793129 -1.033614 -0.751996 -0.156103 -1.756150
2013-01-03 -0.985722 -0.446734  0.069194  0.582819 -0.924979 -1.314141
2013-01-04 -0.466835  0.280120  1.393321 -0.725856 -1.293547 -0.423523
2013-01-05  0.322897 -2.453072 -1.121637  0.506722  0.375510  1.451425

In [126]:
df[df.A > 0]

                   A         B         C         D         E         F
2013-01-01  0.849393 -0.338225 -1.234400 -2.097684 -0.180007 -0.538386
2013-01-05  0.322897 -2.453072 -1.121637  0.506722  0.375510  1.451425
2013-01-06  0.463152 -0.483672 -0.064939 -0.600408  0.892167  1.158472
2013-01-08  1.621622 -0.750952 -0.212247 -0.420051 -0.080137  0.295026
2013-01-09  0.052636 -0.211462 -0.622754  0.253277 -0.156381 -3.228651

In [134]:
df[ df.B <0][df.A > 0]

/Users/zoomq/.pyenv/versions/3.6.1/envs/DU361/lib/python3.6/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

                   A         B         C         D         E         F
2013-01-01  0.849393 -0.338225 -1.234400 -2.097684 -0.180007 -0.538386
2013-01-05  0.322897 -2.453072 -1.121637  0.506722  0.375510  1.451425
2013-01-06  0.463152 -0.483672 -0.064939 -0.600408  0.892167  1.158472
2013-01-08  1.621622 -0.750952 -0.212247 -0.420051 -0.080137  0.295026
2013-01-09  0.052636 -0.211462 -0.622754  0.253277 -0.156381 -3.228651

In [135]:
df[df > 0]

                   A         B         C         D         E         F
2013-01-01  0.849393       NaN       NaN       NaN       NaN       NaN
2013-01-02       NaN  0.793129       NaN       NaN       NaN       NaN
2013-01-03       NaN       NaN  0.069194  0.582819       NaN       NaN
2013-01-04       NaN  0.280120  1.393321       NaN       NaN       NaN
2013-01-05  0.322897       NaN       NaN  0.506722  0.375510  1.451425
2013-01-06  0.463152       NaN       NaN       NaN  0.892167  1.158472
2013-01-07       NaN       NaN  0.995858  0.151096  1.540500  2.124193
2013-01-08  1.621622       NaN       NaN       NaN       NaN  0.295026
2013-01-09  0.052636       NaN       NaN  0.253277       NaN       NaN
2013-01-10       NaN  0.501695  0.890174  0.014403  0.994278  1.219175

In [136]:
df2 = df.copy()

In [137]:
_df = df

In [138]:
print('''
df -> {}
df2 ->{}
_df ->{}
'''.format(
id(df)
,id(df2)
,id(_df)
))

df -> 4561275928
df2 ->4567389800
_df ->4561275928

In [143]:
#dates = pd.date_range('20130101', periods=6)
_lines = 6
df2 = pd.DataFrame(np.random.randn(_lines,4)
                  , index=pd.date_range('20130101'
                                        , periods=_lines)
                  , columns=list('ABCD')
                 )
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.239181  0.434750 -2.327515  0.152671    one
2013-01-02  1.404257  0.995311 -1.010968 -0.806000    one
2013-01-03  0.889347  1.699392  1.739210  2.494463    two
2013-01-04 -0.491119  2.122522  0.676805 -0.661621  three
2013-01-05  0.365821  1.338847 -0.201232 -0.082878   four
2013-01-06 -0.030771 -0.647283 -0.802089 -1.330662  three

In [144]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.889347  1.699392  1.739210  2.494463   two
2013-01-05  0.365821  1.338847 -0.201232 -0.082878  four

In [152]:
len(dir(df2['E']))

440

In [153]:
for f in dir(df2['E']):
    if 'is' in f:
        print(f)

__isub__
_check_is_chained_assignment_possible
_get_axis
_get_axis_name
_get_axis_number
_get_axis_resolvers
_get_block_manager_axis
_info_axis
_info_axis_name
_info_axis_number
_is_builtin_func
_is_cached
_is_cython_func
_is_datelike_mixed_type
_is_mixed_type
_is_numeric_mixed_type
_is_view
_reindex_axis
_selection_list
_set_axis
_set_axis_name
_set_is_copy
_stat_axis
_stat_axis_name
_stat_axis_number
hist
is_copy
is_monotonic
is_monotonic_decreasing
is_monotonic_increasing
is_unique
isin
isnull
kurtosis
reindex_axis
rename_axis
set_axis
tolist

In [154]:
df2[not df2['E'].isin(['two','four'])]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

### 设定

In [164]:
s1 = pd.Series([1,2,3,4,5,6]
               , index=pd.date_range(
                   '20140102', periods=6))
s1

2014-01-02    1
2014-01-03    2
2014-01-04    3
2014-01-05    4
2014-01-06    5
2014-01-07    6
Freq: D, dtype: int64

In [165]:
df

                   A         B         C         D         E   F
2013-01-01  0.849393 -0.338225 -1.234400 -2.097684 -0.180007 NaN
2013-01-02 -0.731341  0.793129 -1.033614 -0.751996 -0.156103 NaN
2013-01-03 -0.985722 -0.446734  0.069194  0.582819 -0.924979 NaN
2013-01-04 -0.466835  0.280120  1.393321 -0.725856 -1.293547 NaN
2013-01-05  0.322897 -2.453072 -1.121637  0.506722  0.375510 NaN
2013-01-06  0.463152 -0.483672 -0.064939 -0.600408  0.892167 NaN
2013-01-07 -0.800244 -0.721945  0.995858  0.151096  1.540500 NaN
2013-01-08  1.621622 -0.750952 -0.212247 -0.420051 -0.080137 NaN
2013-01-09  0.052636 -0.211462 -0.622754  0.253277 -0.156381 NaN
2013-01-10 -0.316654  0.501695  0.890174  0.014403  0.994278 NaN

In [166]:
df['F'] = s1

In [167]:
df

                   A         B         C         D         E   F
2013-01-01  0.849393 -0.338225 -1.234400 -2.097684 -0.180007 NaN
2013-01-02 -0.731341  0.793129 -1.033614 -0.751996 -0.156103 NaN
2013-01-03 -0.985722 -0.446734  0.069194  0.582819 -0.924979 NaN
2013-01-04 -0.466835  0.280120  1.393321 -0.725856 -1.293547 NaN
2013-01-05  0.322897 -2.453072 -1.121637  0.506722  0.375510 NaN
2013-01-06  0.463152 -0.483672 -0.064939 -0.600408  0.892167 NaN
2013-01-07 -0.800244 -0.721945  0.995858  0.151096  1.540500 NaN
2013-01-08  1.621622 -0.750952 -0.212247 -0.420051 -0.080137 NaN
2013-01-09  0.052636 -0.211462 -0.622754  0.253277 -0.156381 NaN
2013-01-10 -0.316654  0.501695  0.890174  0.014403  0.994278 NaN

In [168]:
df.at[dates[0],'A'] = 0

In [169]:
df

                   A         B         C         D         E   F
2013-01-01  0.000000 -0.338225 -1.234400 -2.097684 -0.180007 NaN
2013-01-02 -0.731341  0.793129 -1.033614 -0.751996 -0.156103 NaN
2013-01-03 -0.985722 -0.446734  0.069194  0.582819 -0.924979 NaN
2013-01-04 -0.466835  0.280120  1.393321 -0.725856 -1.293547 NaN
2013-01-05  0.322897 -2.453072 -1.121637  0.506722  0.375510 NaN
2013-01-06  0.463152 -0.483672 -0.064939 -0.600408  0.892167 NaN
2013-01-07 -0.800244 -0.721945  0.995858  0.151096  1.540500 NaN
2013-01-08  1.621622 -0.750952 -0.212247 -0.420051 -0.080137 NaN
2013-01-09  0.052636 -0.211462 -0.622754  0.253277 -0.156381 NaN
2013-01-10 -0.316654  0.501695  0.890174  0.014403  0.994278 NaN

In [170]:
df.iat[0,1] = 0

In [171]:
df

                   A         B         C         D         E   F
2013-01-01  0.000000  0.000000 -1.234400 -2.097684 -0.180007 NaN
2013-01-02 -0.731341  0.793129 -1.033614 -0.751996 -0.156103 NaN
2013-01-03 -0.985722 -0.446734  0.069194  0.582819 -0.924979 NaN
2013-01-04 -0.466835  0.280120  1.393321 -0.725856 -1.293547 NaN
2013-01-05  0.322897 -2.453072 -1.121637  0.506722  0.375510 NaN
2013-01-06  0.463152 -0.483672 -0.064939 -0.600408  0.892167 NaN
2013-01-07 -0.800244 -0.721945  0.995858  0.151096  1.540500 NaN
2013-01-08  1.621622 -0.750952 -0.212247 -0.420051 -0.080137 NaN
2013-01-09  0.052636 -0.211462 -0.622754  0.253277 -0.156381 NaN
2013-01-10 -0.316654  0.501695  0.890174  0.014403  0.994278 NaN

In [173]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D         E   F
2013-01-01  0.000000  0.000000 -1.234400  5 -0.180007 NaN
2013-01-02 -0.731341  0.793129 -1.033614  5 -0.156103 NaN
2013-01-03 -0.985722 -0.446734  0.069194  5 -0.924979 NaN
2013-01-04 -0.466835  0.280120  1.393321  5 -1.293547 NaN
2013-01-05  0.322897 -2.453072 -1.121637  5  0.375510 NaN
2013-01-06  0.463152 -0.483672 -0.064939  5  0.892167 NaN
2013-01-07 -0.800244 -0.721945  0.995858  5  1.540500 NaN
2013-01-08  1.621622 -0.750952 -0.212247  5 -0.080137 NaN
2013-01-09  0.052636 -0.211462 -0.622754  5 -0.156381 NaN
2013-01-10 -0.316654  0.501695  0.890174  5  0.994278 NaN

In [174]:
df.loc[:,'D'] =  len(df)
df

                   A         B         C   D         E   F
2013-01-01  0.000000  0.000000 -1.234400  10 -0.180007 NaN
2013-01-02 -0.731341  0.793129 -1.033614  10 -0.156103 NaN
2013-01-03 -0.985722 -0.446734  0.069194  10 -0.924979 NaN
2013-01-04 -0.466835  0.280120  1.393321  10 -1.293547 NaN
2013-01-05  0.322897 -2.453072 -1.121637  10  0.375510 NaN
2013-01-06  0.463152 -0.483672 -0.064939  10  0.892167 NaN
2013-01-07 -0.800244 -0.721945  0.995858  10  1.540500 NaN
2013-01-08  1.621622 -0.750952 -0.212247  10 -0.080137 NaN
2013-01-09  0.052636 -0.211462 -0.622754  10 -0.156381 NaN
2013-01-10 -0.316654  0.501695  0.890174  10  0.994278 NaN

In [178]:
np.array([5]*10)

array([5, 5, 5, 5, 5, 5, 5, 5, 5, 5])

In [180]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C   D         E   F
2013-01-01  0.000000  0.000000 -1.234400 -10 -0.180007 NaN
2013-01-02 -0.731341 -0.793129 -1.033614 -10 -0.156103 NaN
2013-01-03 -0.985722 -0.446734 -0.069194 -10 -0.924979 NaN
2013-01-04 -0.466835 -0.280120 -1.393321 -10 -1.293547 NaN
2013-01-05 -0.322897 -2.453072 -1.121637 -10 -0.375510 NaN
2013-01-06 -0.463152 -0.483672 -0.064939 -10 -0.892167 NaN
2013-01-07 -0.800244 -0.721945 -0.995858 -10 -1.540500 NaN
2013-01-08 -1.621622 -0.750952 -0.212247 -10 -0.080137 NaN
2013-01-09 -0.052636 -0.211462 -0.622754 -10 -0.156381 NaN
2013-01-10 -0.316654 -0.501695 -0.890174 -10 -0.994278 NaN

### 缺失数据

对于经常发生的数据集中残缺现象进行一致性处理

In [182]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C   D         E   F         E
2013-01-01  0.000000  0.000000 -1.234400  10 -0.180007 NaN -0.180007
2013-01-02 -0.731341  0.793129 -1.033614  10 -0.156103 NaN -0.156103
2013-01-03 -0.985722 -0.446734  0.069194  10 -0.924979 NaN -0.924979
2013-01-04 -0.466835  0.280120  1.393321  10 -1.293547 NaN -1.293547

In [183]:
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C   D         E   F         E
2013-01-01  0.000000  0.000000 -1.234400  10  1.000000 NaN  1.000000
2013-01-02 -0.731341  0.793129 -1.033614  10  1.000000 NaN  1.000000
2013-01-03 -0.985722 -0.446734  0.069194  10 -0.924979 NaN -0.924979
2013-01-04 -0.466835  0.280120  1.393321  10 -1.293547 NaN -1.293547

In [186]:
df1.dropna(how='any')

Empty DataFrame
Columns: [A, B, C, D, E, F, E]
Index: []

In [187]:
_lines = 6
df = pd.DataFrame(np.random.randn(_lines,4)
                  , index=pd.date_range('20130101'
                                        , periods=_lines)
                  , columns=list('ABCD')
                 )
df

                   A         B         C         D
2013-01-01  0.383615  0.992160  0.140152  0.095695
2013-01-02  0.096747 -1.439182 -0.012292  0.650657
2013-01-03  0.756489  0.928985  0.594471  2.111443
2013-01-04 -0.252702  0.504302  1.500656  1.036571
2013-01-05  1.777794 -2.619767  0.620617 -0.931244
2013-01-06  1.173008  0.593133  0.076353 -0.532924

In [188]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C         D    E
2013-01-01  0.383615  0.992160  0.140152  0.095695  1.0
2013-01-02  0.096747 -1.439182 -0.012292  0.650657  1.0
2013-01-03  0.756489  0.928985  0.594471  2.111443  NaN
2013-01-04 -0.252702  0.504302  1.500656  1.036571  NaN

In [189]:
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01  0.383615  0.992160  0.140152  0.095695  1.0
2013-01-02  0.096747 -1.439182 -0.012292  0.650657  1.0

In [190]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01  0.383615  0.992160  0.140152  0.095695  1.0
2013-01-02  0.096747 -1.439182 -0.012292  0.650657  1.0
2013-01-03  0.756489  0.928985  0.594471  2.111443  5.0
2013-01-04 -0.252702  0.504302  1.500656  1.036571  5.0

In [194]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 4 entries, 2013-01-01 to 2013-01-04
Freq: D
Data columns (total 5 columns):
A    4 non-null float64
B    4 non-null float64
C    4 non-null float64
D    4 non-null float64
E    2 non-null float64
dtypes: float64(5)
memory usage: 352.0 bytes

In [195]:
pd.isna(df1)

AttributeError: module 'pandas' has no attribute 'isna'

## Operations
### 状态

In [196]:
df.mean()

A    0.655825
B   -0.173395
C    0.486660
D    0.405033
dtype: float64

In [198]:
df.mean(0)

A    0.655825
B   -0.173395
C    0.486660
D    0.405033
dtype: float64

In [204]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [205]:
help(pd.Series([1,3,5,np.nan,6,8], index=dates).shift)

Help on method shift in module pandas.core.series:

shift(periods=1, freq=None, axis=0) method of pandas.core.series.Series instance
    Shift index by desired number of periods with an optional time freq

    Parameters
    ----------
    periods : int
        Number of periods to move, can be positive or negative
    freq : DateOffset, timedelta, or time rule string, optional
        Increment to use from the tseries module or time rule (e.g. 'EOM').
        See Notes.
    axis : {0, 'index'}

    Notes
    -----
    If freq is specified then the index values are shifted but the data
    is not realigned. That is, use freq if you would like to extend the
    index when shifting and preserve the original data.

    Returns
    -------
    shifted : Series

In [206]:
df.sub(s, axis='index')

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03 -0.243511 -0.071015 -0.405529  1.111443
2013-01-04 -3.252702 -2.495698 -1.499344 -1.963429
2013-01-05 -3.222206 -7.619767 -4.379383 -5.931244
2013-01-06       NaN       NaN       NaN       NaN

In [207]:
df

                   A         B         C         D
2013-01-01  0.383615  0.992160  0.140152  0.095695
2013-01-02  0.096747 -1.439182 -0.012292  0.650657
2013-01-03  0.756489  0.928985  0.594471  2.111443
2013-01-04 -0.252702  0.504302  1.500656  1.036571
2013-01-05  1.777794 -2.619767  0.620617 -0.931244
2013-01-06  1.173008  0.593133  0.076353 -0.532924

In [208]:
### 应用

In [209]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.383615  0.992160  0.140152  0.095695
2013-01-02  0.480361 -0.447022  0.127861  0.746352
2013-01-03  1.236851  0.481962  0.722332  2.857796
2013-01-04  0.984149  0.986264  2.222988  3.894366
2013-01-05  2.761943 -1.633503  2.843605  2.963122
2013-01-06  3.934952 -1.040370  2.919958  2.430198

In [210]:
df

                   A         B         C         D
2013-01-01  0.383615  0.992160  0.140152  0.095695
2013-01-02  0.096747 -1.439182 -0.012292  0.650657
2013-01-03  0.756489  0.928985  0.594471  2.111443
2013-01-04 -0.252702  0.504302  1.500656  1.036571
2013-01-05  1.777794 -2.619767  0.620617 -0.931244
2013-01-06  1.173008  0.593133  0.076353 -0.532924

In [211]:
df.apply(lambda x: x.max() - x.min())

A    2.030496
B    3.611927
C    1.512948
D    3.042687
dtype: float64

In [215]:
df.A.apply(lambda x: '%.3f'% x)

2013-01-01     0.384
2013-01-02     0.097
2013-01-03     0.756
2013-01-04    -0.253
2013-01-05     1.778
2013-01-06     1.173
Freq: D, Name: A, dtype: object

### Histogramming

In [216]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    0
1    5
2    0
3    4
4    4
5    2
6    6
7    3
8    3
9    4
dtype: int64

In [217]:
s.value_counts()

4    3
3    2
0    2
6    1
5    1
2    1
dtype: int64

### 字串方法

In [218]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [219]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [221]:
len(dir(s.str))

86

### 合并
#### 内容?

In [222]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -1.387380 -1.516855 -0.887857  2.090650
1  1.083541  0.452381  0.587926  1.299482
2 -0.583349  0.643526 -0.804890  1.006887
3  1.241597 -1.267885  0.588110 -0.738862
4 -1.614764 -0.509393  0.415184 -0.566187
5 -0.690416  0.375007  1.977332  0.409070
6  1.177187 -0.506812  1.580440  2.038233
7 -0.364814 -0.529932 -0.901207  0.377846
8 -0.162166  0.559632 -2.007471 -0.755310
9 -0.214948 -1.029192  0.715028  0.669154

In [226]:
pieces = [df[:4], df[3:], df[-2:]]
pieces

[          0         1         2         3
 0 -1.387380 -1.516855 -0.887857  2.090650
 1  1.083541  0.452381  0.587926  1.299482
 2 -0.583349  0.643526 -0.804890  1.006887
 3  1.241597 -1.267885  0.588110 -0.738862,
           0         1         2         3
 3  1.241597 -1.267885  0.588110 -0.738862
 4 -1.614764 -0.509393  0.415184 -0.566187
 5 -0.690416  0.375007  1.977332  0.409070
 6  1.177187 -0.506812  1.580440  2.038233
 7 -0.364814 -0.529932 -0.901207  0.377846
 8 -0.162166  0.559632 -2.007471 -0.755310
 9 -0.214948 -1.029192  0.715028  0.669154,
           0         1         2         3
 8 -0.162166  0.559632 -2.007471 -0.755310
 9 -0.214948 -1.029192  0.715028  0.669154]

In [227]:
pd.concat(pieces)

          0         1         2         3
0 -1.387380 -1.516855 -0.887857  2.090650
1  1.083541  0.452381  0.587926  1.299482
2 -0.583349  0.643526 -0.804890  1.006887
3  1.241597 -1.267885  0.588110 -0.738862
3  1.241597 -1.267885  0.588110 -0.738862
4 -1.614764 -0.509393  0.415184 -0.566187
5 -0.690416  0.375007  1.977332  0.409070
6  1.177187 -0.506812  1.580440  2.038233
7 -0.364814 -0.529932 -0.901207  0.377846
8 -0.162166  0.559632 -2.007471 -0.755310
9 -0.214948 -1.029192  0.715028  0.669154
8 -0.162166  0.559632 -2.007471 -0.755310
9 -0.214948 -1.029192  0.715028  0.669154

### 追加

In [230]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [231]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [233]:
left

   key  lval
0  foo     1
1  bar     2

In [234]:
right

   key  rval
0  foo     4
1  bar     5

### 追加